"ch13ex00k1" = "// Legg til eventuelle rader som mangler, i matrisen.";

"ch13ex00k2" = "// Plasserer en figur på hver rad i rader.";

"ch13ex01k1" = "// Gi løkkevariabelen et navn, og send den inn i matrisen.";

"ch13ex01k2" = "    // Plasser en stein og en bryter for hver kolonne.";

"ch13ex02k1" = "// Legg til de to hjørnekoordinatene som gjenstår.";

"ch13ex02k2" = "// Plasser fem blokker på hver koordinat.";

"ch13ex03k1" = "// Fjern portalen.";

"ch13ex03k2" = "// Fjern steinen.";

"ch13ex03k3" = "// Sett inn eksperten.";

"ch13ex04k1" = "    // Let etter koordinater med en kolonne > 5 ELLER en rad < 4.";

"ch13ex04k2" = "        // Tilføy koordinat i blockSet.";

"ch13ex04k3" = "// Plasser seks blokker for hver koordinat i blockSet.";

"ch13ex05k1" = "// Lag to tomme matriser av typen [koordinat].";

"ch13ex05k2" = "        // Tilføy i øymatrise.";

"ch13ex05k3" = "        // Tilføy i havmatrise.";

"ch13ex05k4" = "// Plasser blokker for øymatrisen.";

"ch13ex05k5" = "// Plasser vann for havmatrisen.";

"ch13ex06k1" = "// Lag en matrise med alle koordinater i rad 2.";

"ch13ex06k2" = "// Lag en tom matrise med koordinater.";

"ch13ex06k3" = "    // Fjern en koordinat, og tilføy den i den tomme matrisen.";

"ch13ex06k4" = "// Plasser en figur for hver koordinat som legges til i den tomme matrisen.";

"ch13ex07k1" = "// Legg merke til hvor mange instanser av Blu som finnes i matrisen.";

"ch13ex07k2" = "// Plasser Blu i hver kolonne på rad 4.";

"ch13ex07k3" = "// Finn indeks utenfor matrisen-feilen.";

"ch13ex08k1" = "        // Plasser en blokk.";

"ch13ex08k2" = "    // Øk indeksen.";

"ch13ex09k1" = "// Tilføy tilfeldige tall til høyder.";

"ch13ex09k2" = "    // currentHeight lagrer høyden i den aktuelle indeksen.";

"ch13ex09k3" = "        // Gjør noe interessant hvis currentHeight er lik 0.";

"ch13ex09k4" = "            // Gjør noe annet, som å plassere en figur.";

"ch13ex09k5" = "            // Gjør noe annet, som å plassere vann.";

"ch13ex09k6" = "        // Legg til flere regler for å tilpasse verdenen.";

"ch13ex10k1" = "    // Endre høyden, slik at den er summen av kolonnen og raden for hver koordinat.";

"ch13ex10k2" = "// Initialiser en matrise med eksisterende figurer i oppgaveverdenen.";

"ch13ex10k3" = "// Utfør et sett med handlinger for hver figur.";

"ch13ex11k1" = "// Lag koordinatsoner.";

"ch13ex11k2" = "// Plasser plattformlåser.";

"ch13ex11k3" = "// Plasser figurer og plattformer.";

"ch13ex11k4" = "// Lag matriser fra eksisterende figurer.";

"ch13ex11k5" = "// Gjør spennende ting 🤓.";
